Revit 2024 API
BuiltInFailures.RebarFailures.RebarShapeFailureCustomWarning Property
 '[ErrorMessage]'
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId RebarShapeFailureCustomWarning { get; }
Visual Basic
Public Shared ReadOnly Property RebarShapeFailureCustomWarning As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ RebarShapeFailureCustomWarning {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace